## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| add    | `aws_glue_crawler.platform_gc_design_system_cloudfront` |
|        | `aws_glue_crawler.platform_gc_design_system_npm`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_crawler.platform_gc_design_system_cloudfront will be created
  + resource "aws_glue_crawler" "platform_gc_design_system_cloudfront" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                  + Tables     = {
                      + AddOrUpdateBehavior = "MergeNewColumns"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name          = "platform_gc_design_system"
      + description            = "Classify the GC Design System CloudFront log data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Design System / CloudFront"
      + region                 = "ca-central-1"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + schedule               = "cron(0 6 * * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_design_system_"
      + tags                   = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-transformed-production/platform/gc-design-system/cloudfront-logs/"
        }

      + schema_change_policy {
          + delete_behavior = "DELETE_FROM_DATABASE"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # aws_glue_crawler.platform_gc_design_system_npm will be created
  + resource "aws_glue_crawler" "platform_gc_design_system_npm" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                  + Tables     = {
                      + AddOrUpdateBehavior = "MergeNewColumns"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name          = "platform_gc_design_system"
      + description            = "Classify the GC Design System NPM download data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Design System / NPM"
      + region                 = "ca-central-1"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_design_system_"
      + tags                   = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-transformed-production/platform/gc-design-system/npm/"
        }

      + schema_change_policy {
          + delete_behavior = "DELETE_FROM_DATABASE"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + platform_gc_design_system_npm_crawler_arn  = (known after apply)
  + platform_gc_design_system_npm_crawler_name = "Platform / GC Design System / NPM"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_design_system"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_design_system_airtable"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_design_system_cloudfront"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_design_system_npm"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
